Repository: zhumingjie1996/hold-it
Catalog: hold-it-ios/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, zh_hant

source: %lld 条金额记录
en: %lld amount records
ja: %lld件の金額記録
zh_hant: %lld 筆金額記錄

source: %lld 次
en: %lld times
ja: %lld回

# %lld 次 · %lld%%
source: %1$lld 次 · %2$lld%%
en: %lld times · %lld%%
ja: %lld回 · %lld%%
zh_hant: %lld 次 · %lld%%

# To Myself
source: 致自己
en: To Myself
ja: 自分へ
zh_hant: 緻自己

source: 一次购买，终身使用
en: One-time purchase, lifetime access
ja: 一度の購入で永久利用
zh_hant: 一次購買，終身使用

source: 上午
en: Morning
ja: 午前

source: 下午
en: Afternoon
ja: 午後

source: 主题
en: Theme
ja: テーマ
zh_hant: 主題

source: 享受所有高级功能
en: Access all premium features
ja: すべてのプレミアム機能を利用
zh_hant: 享受所有進階功能

source: 亮点数据
en: Highlights
ja: ハイライト
zh_hant: 亮點數據

source: 人民币 (¥)
en: CNY (¥)
ja: 中国元 (¥)
zh_hant: 人民幣 (¥)

source: 今天
en: Today
ja: 今日

source: 今天已忍住
en: Today
ja: 今日

source: 今年
en: This Year

source: 你又忍住了一次 %@
en: You resisted %@ again!
ja: また %@ を我慢しました！

source: 你忍住了什么？
en: What did you resist?
ja: 何を我慢しましたか？
zh_hant: 你忍住了什麼？

source: 保存
en: Save
zh_hant: 儲存

source: 保存记录
en: Save
ja: 保存
zh_hant: 保存記錄

source: 傍晚
en: Late PM
ja: 夕方

source: 全年忍住频率可视化
en: Visualize yearly restraint frequency
ja: 年間の記録頻度を可視化
zh_hant: 全年忍住頻率可視化

source: 全部
en: All
ja: すべて

source: 全部记录
en: All Records
ja: すべての記録
zh_hant: 全部記錄

source: 共 %lld 条忍住记录
en: %lld restraint records
ja: %lld 件の記録
zh_hant: 共 %lld 條忍住記錄

source: 关于
en: About
ja: アプリについて
zh_hant: 關於

source: 关于忍一下
en: About Hold It
ja: 我慢について
zh_hant: 關於忍一下

source: 其他
en: Other
ja: その他

source: 最佳一天
en: Best Day
ja: ベストデー

source: 最长连续
en: Best Streak
ja: 最長連続
zh_hant: 最長連續

source: 冲动消费
en: Impulse Buy
ja: 衝動買い
zh_hant: 衝動消費

source: 凌晨
en: Early AM
ja: 深夜

source: 分类分析
en: Category Analysis
ja: カテゴリ分析
zh_hant: 分類分析

source: 分类统计
en: By Category
ja: カテゴリ別
zh_hant: 分類統計

source: 分类节省排行
en: Savings by Category
ja: カテゴリ別節約ランキング
zh_hant: 分類節省排行

source: 刚刚
en: Just now
ja: たった今
zh_hant: 剛剛

source: 删除
en: Delete
ja: 削除
zh_hant: 刪除

source: 删除忍住项
en: Delete Category
ja: カテゴリ削除
zh_hant: 刪除忍住項

source: 前往系统设置更改语言
en: Change in System Settings
ja: システム設定で変更
zh_hant: 前往系統設定更改語言

source: 午前
en: Late AM
ja: 昼前

source: 危险操作
en: Danger Zone
ja: 危険操作
zh_hant: 危險操作

source: 去首页记录你的第一次忍住吧
en: Go to Home to record your first restraint
ja: ホームで最初の記録をしましょう
zh_hant: 去首頁記錄你的第一次忍住吧

source: 取消
en: Cancel
ja: キャンセル

source: 可选
en: Optional
ja: 任意
zh_hant: 可選

source: 台币 (NT$)
en: TWD (NT$)
ja: 台湾ドル (NT$)
zh_hant: 台幣 (NT$)

source: 合计
en: Total
ja: 合計
zh_hant: 合計

source: 名称
en: Name
ja: 名前
zh_hant: 名稱

source: 周一
en: Mon
ja: 月
zh_hant: 週一

source: 周三
en: Wed
ja: 水
zh_hant: 週三

source: 周二
en: Tue
ja: 火
zh_hant: 週二

source: 周五
en: Fri
ja: 金
zh_hant: 週五

source: 周六
en: Sat
ja: 土
zh_hant: 週六

source: 周几最忍住
en: Best Restraint Day
ja: 最も我慢した曜日
zh_hant: 週幾最忍住

source: 周几分布
en: By Weekday
ja: 曜日別
zh_hant: 週幾分佈

source: 周四
en: Thu
ja: 木
zh_hant: 週四

source: 周日
en: Sun
ja: 日
zh_hant: 週日

source: 基于 %lld 条记录
en: Based on %lld records
ja: %lld件の記録に基づく
zh_hant: 基於 %lld 條記錄

source: 基本信息
en: Basic Info
ja: 基本情報
zh_hant: 基本資訊

source: 备注（可选）
en: Note (optional)
ja: メモ（任意）
zh_hant: 備註（可選）

source: 外观
en: Appearance
ja: 外観
zh_hant: 外觀

source: 多
en: More

source: 多维度节省金额分析
en: Multi-dimensional savings analysis
ja: 多角的な節約分析
zh_hant: 多維度節省金額分析

source: 天
en: days
ja: 日

source: 奶茶
en: Milk Tea
ja: タピオカ

source: 完成
en: Done
ja: 完了

source: 少
en: Less

source: 差点下单新键盘…
en: Almost ordered a new keyboard…
ja: もう少しで新しいキーボードを注文するところだった…
zh_hant: 差點下單新鍵盤…

source: 已成功恢复购买
en: Purchases restored successfully
ja: 購入が復元されました
zh_hant: 已成功恢復購買

source: 已激活终身会员
en: Lifetime Member Active
ja: 生涯会員有効
zh_hant: 已啟用終身會員

source: 已记录
en: Saved!
ja: 記録しました！
zh_hant: 已記錄

source: 平均每次
en: Average per time
ja: 1回あたり平均

# 平均每次 %@%@
source: 平均每次 %1$@%2$@
en: Avg. per time %@%@
ja: 1回あたり%@%@
zh_hant: 平均每次 %@%@

source: 忍一下
en: Hold It
ja: 我慢

source: 忍一下是一款专门记录忍住行为的极简 App。我们不记录「完成了什么」，而是记录「忍住了什么」——没喝奶茶、没刷短视频、没冲动消费。每一次忍住，都是对自己的一次胜利。
en: Hold It is a minimalist app for recording moments of self-restraint. Instead of tracking what you completed, you track what you resisted — skipping milk tea, avoiding impulse buys, not doom-scrolling. Every act of restraint is a small victory.
ja: 「我慢」は自制の瞬間を記録するミニマルなアプリです。「完了したこと」ではなく「我慢したこと」を記録します。タピオカを我慢した、衝動買いを避けた、動画を見るのをやめた。すべての我慢が小さな勝利です。
zh_hant: 忍一下是一款專門記錄忍住行為的極簡 App。我們不記錄「完成了什麼」，而是記錄「忍住了什麼」——沒喝奶茶、沒刷短視頻、沒衝動消費。每一次忍住，都是對自己的一次勝利。

source: 忍住项名称
en: Category Name
ja: 項目名
zh_hant: 忍住項名稱

source: 恢复购买
en: Restore Purchases
ja: 購入を復元
zh_hant: 恢復購買

source: 意见反馈
en: Feedback
ja: フィードバック
zh_hant: 意見反饋

source: 抹除
en: Erase
ja: 消去

source: 抹除所有数据
en: Erase All Data
ja: すべてのデータを消去
zh_hant: 抹除所有資料

source: 持平
en: Same
ja: 同じ

source: 换个筛选条件试试
en: Try a different filter
ja: 別のフィルターを試してください
zh_hant: 換個篩選條件試試

source: 排序
en: Sort
ja: 並び替え

source: 摸鱼
en: Slacking
ja: サボり
zh_hant: 摸魚

source: 支持
en: Support
ja: サポート
zh_hant: 支援

source: 新增忍住项
en: Add Category
ja: カテゴリ追加
zh_hant: 新增忍住項

source: 日元 (¥)
en: JPY (¥)
ja: 日本円 (¥)
zh_hant: 日圓 (¥)

source: 早晨
en: Morning
ja: 朝

source: 时段分析
en: Time of Day
ja: 時間帯分析
zh_hant: 時段分析

source: 时段对比
en: Period Comparison
ja: 期間比較
zh_hant: 時段對比

source: 时间
en: Time
ja: 時間
zh_hant: 時間

source: 时间线
en: Timeline
ja: タイムライン
zh_hant: 時間線

source: 昨天
en: Yesterday
ja: 昨日

source: 晚上
en: Evening
ja: 夜

source: 暂不需要
en: Not Now
ja: 後で
zh_hant: 暫不需要

source: 暂无数据
en: No Data
ja: データなし
zh_hant: 暫無數據

source: 暂无记录
en: No Records Yet
ja: 記録なし
zh_hant: 暫無記錄

source: 暂无金额数据
en: No amount data yet
ja: 金額データなし
zh_hant: 暫無金額數據

source: 暂无金额记录
en: No Savings Records
ja: 節約記録なし
zh_hant: 暫無金額記錄

source: 月度节省趋势
en: Monthly Savings Trend
ja: 月間節約トレンド
zh_hant: 月度節省趨勢

source: 月度趋势
en: Monthly Trend
ja: 月次トレンド
zh_hant: 月度趨勢

source: 未找到购买记录
en: No purchases found
ja: 購入記録が見つかりません
zh_hant: 未找到購買記錄

source: 本周
en: This Week
ja: 今週
zh_hant: 本週

source: 本月
en: This Month
ja: 今月

source: 本月已省
en: Saved This Month
ja: 今月の節約

source: 本月第 %lld/%lld 天
en: Day %1$lld/%2$lld of the month
ja: 今月%1$lld/%2$lld日目
zh_hant: 本月第 %1$lld/%2$lld 天

source: 条记录
en: records
ja: 件の記録
zh_hant: 條記錄

source: 条金额记录
en: records with amount
ja: 件の金額記録
zh_hant: 條金額記錄

source: 查看每个分类的忍住次数
en: View restraint count by category
ja: カテゴリ別の記録数を見る
zh_hant: 查看每個分類的忍住次數

source: 模块排序
en: Sort Modules
ja: モジュール並び替え
zh_hant: 模組排序

source: 次
en: times
ja: 回

source: 欧元 (€)
en: EUR (€)
ja: ユーロ (€)
zh_hant: 歐元 (€)

source: 此操作不可恢复，所有忍住记录和自定义分类将被永久删除。
en: This action cannot be undone. All records and custom categories will be permanently deleted.
ja: この操作は元に戻せません。すべての記録とカスタムカテゴリが永久に削除されます。
zh_hant: 此操作不可恢復，所有忍住記錄和自定義分類將被永久刪除。

source: 法律
en: Legal
ja: 法的事項

source: 浅色
en: Light
ja: ライト
zh_hant: 淺色

source: 涉及金钱支出
en: Involves Spending
ja: お金に関わる
zh_hant: 涉及金錢支出

source: 深夜
en: Late Night

source: 深色
en: Dark
ja: ダーク

source: 港元 (HK$)
en: HKD (HK$)
ja: 香港ドル (HK$)
zh_hant: 港幣 (HK$)

source: 游戏
en: Gaming
ja: ゲーム
zh_hant: 遊戲

source: 点击上方按钮，记录你忍住的小事
en: Tap the button above to record your first restraint
ja: 上のボタンをタップして最初の記録をしましょう
zh_hant: 點擊上方按鈕，記錄你忍住的小事

source: 点击记录
en: Tap to Record
ja: タップして記録
zh_hant: 點擊記錄

source: 点此输入 Emoji，切换到 😊 键盘
en: Tap to enter Emoji, switch to 😊 keyboard
ja: タップして絵文字を入力、😊キーボードに切り替え
zh_hant: 點此輸入 Emoji，切換到 😊 鍵盤

source: 烟酒
en: Smoke & Drink
ja: タバコ・お酒
zh_hant: 煙酒

source: 热力图
en: Activity Map
ja: アクティビティマップ
zh_hant: 熱力圖

source: 热力图、趋势图、年度报告等
en: Heatmap, trends, and more
ja: ヒートマップ、トレンドなど
zh_hant: 熱力圖、趨勢圖、年度報告等

source: 熬夜
en: Late Night
ja: 夜更かし

source: 版本 1.0
en: Version 1.0
ja: バージョン 1.0

source: 用户协议
en: Terms of Service
ja: 利用規約
zh_hant: 用戶協議

# 省 %@%lld
source: 省 %1$@%2$lld
en: Saved %@%lld
ja: %@%lld節約
zh_hant: 省 %@%lld

source: 省 ¥%lld
en: Saved ¥%lld
ja: ¥%lld 節約

source: 短视频
en: Short Video
ja: ショート動画
zh_hant: 短視頻

source: 确定
en: OK
ja: OK
zh_hant: 確定

source: 确定删除「%@」吗？已有的记录不会被删除。
en: Are you sure you want to delete "%@"? Existing records won't be deleted.
ja: 「%@」を削除してもよろしいですか？既存の記録は削除されません。
zh_hant: 確定刪除「%@」嗎？已有的記錄不會被刪除。

source: 累计忍住
en: Total
ja: 合計
zh_hant: 累計忍住

source: 累计节省
en: Total Saved
ja: 合計節約
zh_hant: 累計節省

source: 累计节省 %@
en: Total Saved %@
ja: 累計節約 %@
zh_hant: 累計節省 %@

source: 累计节省金额统计
en: Track total money saved
ja: 合計節約金額の記録
zh_hant: 累計節省金額統計

source: 统计
en: Stats
ja: 統計
zh_hant: 統計

source: 编辑
en: Edit
ja: 編集
zh_hant: 編輯

source: 编辑忍住项
en: Edit Category
ja: カテゴリ編集
zh_hant: 編輯忍住項

source: 美元 ($)
en: USD ($)
ja: 米ドル ($)

source: 自定义
en: Custom
ja: カスタム
zh_hant: 自訂

source: 节省了多少钱？（可选）
en: How much did you save? (Optional)
ja: いくら節約した？（任意）
zh_hant: 省了多少錢？（可選）

source: 节省统计
en: Savings Stats
ja: 節約統計
zh_hant: 節省統計

source: 节省记录
en: Savings Records
ja: 節約記録
zh_hant: 節省記錄

source: 英镑 (£)
en: GBP (£)
ja: 英ポンド (£)
zh_hant: 英鎊 (£)

source: 解锁全部高级统计
en: Unlock All Advanced Stats
ja: すべての高度な統計をアンロック
zh_hant: 解鎖全部高級統計

source: 解锁无限自定义
en: Unlock Unlimited Custom Items
ja: カスタム項目を無制限に追加
zh_hant: 解鎖無限自定義

source: 解锁更多自定义
en: Unlock More Custom Items
ja: カスタム項目を追加
zh_hant: 解鎖更多自定義

source: 解锁终身会员
en: Unlock Lifetime
ja: 生涯会員を解除
zh_hant: 解鎖終身會員

source: 解锁高级功能
en: Unlock Premium
ja: プレミアムを解除
zh_hant: 解鎖進階功能

source: 记录忍住，成就更好的自己
en: Record restraint, become your best self
ja: 節制を記録して、より良い自分へ
zh_hant: 記錄忍住，成就更好的自己

source: 记录忍住项时填写金额即可查看
en: Fill in amount when recording to view
ja: 記録時に金額を入力すると表示されます
zh_hant: 記錄忍住項時填寫金額即可查看

source: 记录越多，热力图越丰富
en: More records, richer heatmap
ja: 記録が多いほど、マップが充実します
zh_hant: 記錄越多，熱力圖越豐富

source: 设置
en: Settings
ja: 設定
zh_hant: 設定

source: 评价应用
en: Rate the App
ja: アプリを評価
zh_hant: 評價應用

source: 该功能为会员专属，解锁后可永久使用分类分析、热力图、月度趋势等高级统计功能
en: This feature is for members only. Unlock to access category stats, heatmap, monthly trends, and more.
ja: この機能はメンバー専用です。解除するとカテゴリ分析、ヒートマップ、月次トレンドなどの統計機能をご利用いただけます。
zh_hant: 此功能為會員專屬，解鎖後可永久使用分類分析、熱力圖、月度趨勢等高級統計功能

source: 语言
en: Language
ja: 言語
zh_hant: 語言

source: 货币单位
en: Currency
ja: 通貨
zh_hant: 貨幣單位

source: 购买
en: Buy
ja: 購入
zh_hant: 購買

source: 跟随系统
en: Auto
ja: システム
zh_hant: 跟隨系統

source: 输入金额
en: Enter amount
ja: 金額を入力
zh_hant: 輸入金額

source: 过去6个月的变化趋势
en: Trend over the past 6 months
ja: 過去6ヶ月の変化トレンド
zh_hant: 過去6個月的變化趨勢

source: 连续记录
en: Streak
ja: 連続
zh_hant: 連續記錄

source: 重置
en: Reset
ja: リセット

source: 隐私政策
en: Privacy Policy
ja: プライバシーポリシー
zh_hant: 私隱政策

source: 零食
en: Snacks
ja: おやつ

source: 非会员最多添加3个，解锁后无限添加
en: Free users: 3 max. Unlock for unlimited.
ja: 無料ユーザーは3つまで。アンロックで無制限。
zh_hant: 非會員最多添加3個，解鎖後無限添加

source: 非会员最多添加3个自定义忍住项，解锁后可无限添加。
en: Free users can add up to 3 custom items. Unlock for unlimited.
ja: 無料ユーザーはカスタム項目を3つまで追加できます。アンロックで無制限。
zh_hant: 非會員最多添加3個自定義忍住項，解鎖後可無限添加。

source: 韩元 (₩)
en: KRW (₩)
ja: 韓国ウォン (₩)
zh_hant: 韓元 (₩)

source: 首页
en: Home
ja: ホーム
zh_hant: 首頁

source: 默认节省金额
en: Default Savings
ja: デフォルト節約額
zh_hant: 預設節省金額

source: 忍住没喝一杯…
en: Resisted a cup...
ja: 一杯我慢した…
zh_hant: 忍住沒喝一杯…

source: 忍住买了一个…
en: Resisted an impulse buy...
ja: 買い物を我慢した…
zh_hant: 忍住買了一個…

source: 忍住又玩了一局…
en: Resisted another round...
ja: もう一局我慢した…

source: 忍住刷了一会…
en: Resisted doom-scrolling...
ja: スクロール我慢した…
zh_hant: 忍住刷了一會…

source: 聊表心意
en: A little thought...
ja: 思いを込めて…

source: 写点什么…
en: Write something...
ja: 何か書く…
zh_hant: 寫點什麼…

source: 今天已节省
en: Saved Today
ja: 今日の節約
zh_hant: 今天已節省

source: 元
en: CNY
